; domain
(define (domain driverlog)
  (:requirements :typing)
  (:types         location locatable - object
		driver truck obj - locatable

  )
  (:predicates
		(at ?obj - locatable ?loc - location)
		(in ?obj1 - obj ?obj - truck)
		(driving ?d - driver ?v - truck)
		(link ?x ?y - location) (path ?x ?y - location)
		(empty ?v - truck)
)


(:action LOAD-TRUCK
  :parameters
   (?obj - obj
    ?truck - truck
    ?loc - location)
  :precondition
   (and (at ?truck ?loc) (at ?obj ?loc))
  :effect
   (and (not (at ?obj ?loc)) (in ?obj ?truck)))

(:action UNLOAD-TRUCK
  :parameters
   (?obj - obj
    ?truck - truck
    ?loc - location)
  :precondition
   (and (at ?truck ?loc) (in ?obj ?truck))
  :effect
   (and (not (in ?obj ?truck)) (at ?obj ?loc)))

(:action BOARD-TRUCK
  :parameters
   (?driver - driver
    ?truck - truck
    ?loc - location)
  :precondition
   (and (at ?truck ?loc) (at ?driver ?loc) (empty ?truck))
  :effect
   (and (not (at ?driver ?loc)) (driving ?driver ?truck) (not (empty ?truck))))

(:action DISEMBARK-TRUCK
  :parameters
   (?driver - driver
    ?truck - truck
    ?loc - location)
  :precondition
   (and (at ?truck ?loc) (driving ?driver ?truck))
  :effect
   (and (not (driving ?driver ?truck)) (at ?driver ?loc) (empty ?truck)))

(:action DRIVE-TRUCK
  :parameters
   (?truck - truck
    ?loc-from - location
    ?loc-to - location
    ?driver - driver)
  :precondition
   (and (at ?truck ?loc-from)
   (driving ?driver ?truck) (link ?loc-from ?loc-to))
  :effect
   (and (not (at ?truck ?loc-from)) (at ?truck ?loc-to)))

(:action WALK
  :parameters
   (?driver - driver
    ?loc-from - location
    ?loc-to - location)
  :precondition
   (and (at ?driver ?loc-from) (path ?loc-from ?loc-to))
  :effect
   (and (not (at ?driver ?loc-from)) (at ?driver ?loc-to)))


)

; problem
(define (problem DLOG-1-1-5)
	(:domain driverlog)
	(:objects
	driver1 - driver
	truck1 - truck
	package1 - obj
	package2 - obj
	package3 - obj
	package4 - obj
	package5 - obj
	s0 - location
	s1 - location
	s2 - location
	s3 - location
	s4 - location
	s5 - location
	p0-3 - location
	p2-0 - location
	p2-1 - location
	p2-3 - location
	p2-4 - location
	p4-1 - location
	p4-3 - location
	p4-5 - location
	p5-0 - location
	p5-2 - location
	)
	(:init
	(at driver1 s1)
	(at truck1 s4)
	(empty truck1)
	(at package1 s0)
	(at package2 s0)
	(at package3 s1)
	(at package4 s3)
	(at package5 s3)
	(path s0 p0-3)
	(path p0-3 s0)
	(path s3 p0-3)
	(path p0-3 s3)
	(path s2 p2-0)
	(path p2-0 s2)
	(path s0 p2-0)
	(path p2-0 s0)
	(path s2 p2-1)
	(path p2-1 s2)
	(path s1 p2-1)
	(path p2-1 s1)
	(path s2 p2-3)
	(path p2-3 s2)
	(path s3 p2-3)
	(path p2-3 s3)
	(path s2 p2-4)
	(path p2-4 s2)
	(path s4 p2-4)
	(path p2-4 s4)
	(path s4 p4-1)
	(path p4-1 s4)
	(path s1 p4-1)
	(path p4-1 s1)
	(path s4 p4-3)
	(path p4-3 s4)
	(path s3 p4-3)
	(path p4-3 s3)
	(path s4 p4-5)
	(path p4-5 s4)
	(path s5 p4-5)
	(path p4-5 s5)
	(path s5 p5-0)
	(path p5-0 s5)
	(path s0 p5-0)
	(path p5-0 s0)
	(path s5 p5-2)
	(path p5-2 s5)
	(path s2 p5-2)
	(path p5-2 s2)
	(link s0 s2)
	(link s2 s0)
	(link s0 s5)
	(link s5 s0)
	(link s1 s0)
	(link s0 s1)
	(link s1 s2)
	(link s2 s1)
	(link s2 s4)
	(link s4 s2)
	(link s2 s5)
	(link s5 s2)
	(link s3 s1)
	(link s1 s3)
	(link s3 s4)
	(link s4 s3)
	(link s5 s1)
	(link s1 s5)
	(link s5 s3)
	(link s3 s5)
	(link s5 s4)
	(link s4 s5)
)
	(:goal (and
	(at driver1 s2)
	(at truck1 s1)
	(at package1 s2)
	(at package4 s2)
	(at package5 s0)
	))


)

; plan
1. (walk driver1 s1 p4-1)
   deleted: (at driver1 s1)
   added: (at driver1 p4-1)
   goals met: 0 of 5
2. (walk driver1 p4-1 s4)
   deleted: (at driver1 p4-1)
   added: (at driver1 s4)
   goals met: 0 of 5
3. (board-truck driver1 truck1 s4)
   deleted: (at driver1 s4) (empty truck1)
   added: (driving driver1 truck1)
   goals met: 0 of 5
4. (drive-truck truck1 s4 s3 driver1)
   deleted: (at truck1 s4)
   added: (at truck1 s3)
   goals met: 0 of 5
5. (load-truck package5 truck1 s3)
   deleted: (at package5 s3)
   added: (in package5 truck1)
   goals met: 0 of 5
6. (load-truck package4 truck1 s3)
   deleted: (at package4 s3)
   added: (in package4 truck1)
   goals met: 0 of 5
7. (drive-truck truck1 s3 s1 driver1)
   deleted: (at truck1 s3)
   added: (at truck1 s1)
   goals met: 1 of 5
8. (drive-truck truck1 s1 s0 driver1)
   deleted: (at truck1 s1)
   added: (at truck1 s0)
   goals met: 0 of 5
9. (load-truck package1 truck1 s0)
   deleted: (at package1 s0)
   added: (in package1 truck1)
   goals met: 0 of 5
10. (unload-truck package5 truck1 s0)
   deleted: (in package5 truck1)
   added: (at package5 s0)
   goals met: 1 of 5
11. (drive-truck truck1 s0 s2 driver1)
   deleted: (at truck1 s0)
   added: (at truck1 s2)
   goals met: 1 of 5
12. (unload-truck package1 truck1 s2)
   deleted: (in package1 truck1)
   added: (at package1 s2)
   goals met: 2 of 5
13. (unload-truck package4 truck1 s2)
   deleted: (in package4 truck1)
   added: (at package4 s2)
   goals met: 3 of 5
14. (drive-truck truck1 s2 s1 driver1)
   deleted: (at truck1 s2)
   added: (at truck1 s1)
   goals met: 4 of 5
15. (disembark-truck driver1 truck1 s1)
   deleted: (driving driver1 truck1)
   added: (at driver1 s1) (empty truck1)
   goals met: 4 of 5
16. (walk driver1 s1 p2-1)
   deleted: (at driver1 s1)
   added: (at driver1 p2-1)
   goals met: 4 of 5
17. (walk driver1 p2-1 s2)
   deleted: (at driver1 p2-1)
   added: (at driver1 s2)
   goals met: 5 of 5
